-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 19, 2020 at 05:27 AM
-- Server version: 10.4.8-MariaDB
-- PHP Version: 7.1.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `miniproject`
--

-- --------------------------------------------------------

--
-- Table structure for table `rentedroom`
--

CREATE TABLE `rentedroom` (
  `id_rentedroom` varchar(10) NOT NULL,
  `name_rentedroom` varchar(30) DEFAULT NULL,
  `address_rentedroom` varchar(60) DEFAULT NULL,
  `price` varchar(10) DEFAULT NULL,
  `facilities` varchar(30) DEFAULT NULL,
  `id_type` varchar(10) DEFAULT NULL,
  `restrict_gender` varchar(30) DEFAULT NULL,
  `phone_rentedroom` varchar(12) DEFAULT NULL,
  `id_picture` varchar(40) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `rentedroom`
--

INSERT INTO `rentedroom` (`id_rentedroom`, `name_rentedroom`, `address_rentedroom`, `price`, `facilities`, `id_type`, `restrict_gender`, `phone_rentedroom`, `id_picture`) VALUES
('r0001', 'ธนาทิพย์ อพาร์ทเม้นท์', '91/52ถนนกาญจนวนิช ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา90000', '3000', 'free wifi', 't0002', 'ไม่จำกัด', '086 461 5176', 'ธนาทิพย์ อพาร์ทเม้นท์'),
('r0002', 'กังก์โฮม', '1245/45', '2800', 'free wifi', 't0004', 'ไม่จำกัด', '024 254 4552', 'กังก์โฮม'),
('r0003', 'หอพักหญิงศรีวิไลย', '50/132 ถนนกาญจนวณิช 7, เขารูปช้าง, เมืองสงขลา, สงขลา 90000', '4000', 'free wifi', 't0004', 'หญิง', '089 151 0608', 'หอพักหญิงศรีวิไลย'),
('r0004', 'หอพักสตรีจิตติศักดิ์', 'เปีมสุขอุทิศ ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '3000', 'free wifi', 't0004', 'หญิง', '088 540 5101', 'หอพักสตรีจิตติศักดิ์'),
('r0005', 'BB.Mansion', 'เปี่ยมอุทิศ 1 ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '2800', 'free wifi', 't0003', 'ไม่จำกัด', '0864845806', 'BB. แมนชั่น'),
('r0006', 'INDIGOMansion', '51/120 ถนน กาญจนวนิช ซอย 7 เขารูปช้าง, เมือง, สงขลา 90000', '3200', 'free wifi', 't0003', 'หญิง', '087 475 1843', 'หอพักหญิง INDIGO Mansion 1'),
('r0007', 'วรรณศิริ แมนชั่น', 'ราษฎร์อุทิศ 1 ซอย 11 ตำบลบ่อยาง อำเภอเมืองสงขลา สงขลา 90000', '3000', 'free wifi', 't0003', 'ไม่จำกัด', '099 402 0306', 'วรรณศิริ แมนชั่น'),
('r0008', 'บ้านเจริญผลแมนชั่น', 'ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000 ', '2600', 'free wifi', 't0003', 'ไม่จำกัด', '074 442 777', 'บ้านเจริญผลแมนชั่น'),
('r0009', 'หอพักสตรอิ่มอุ่น', 'เยื้อง ม ราชภัฏ, สงขลา', '2500', 'free wifi', 't0004', 'หญิง', '091 983 2698', 'หอพักสตรอิ่มอุ่น'),
('r0010', 'หอพักหญิงสุกัญญา', 'ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '3000', 'free wifi', 't0004', 'หญิง', '065 030 6655', 'หอพักหญิงสุกัญญา'),
('r0011', 'บ้านษิตวรรณ', '60/3 ตำบลเขารูปช้าง อำเภอเมืองสงขลา จังหวัดสงขลา, 90000 ', '3200', 'free wifi', 't0004', 'ไม่จำกัด', '074 313 900', 'บ้านษิตวรรณ'),
('r0012', 'บ้านสลิล อพาร์ทเมนท์', '94/24กาญจนวนิช ซอย 11 เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '3200', 'free wifi', 't0002', 'ไม่จำกัด', '081 540 9349', 'บ้านสลิล อพาร์ทเมนท์'),
('r0013', 'ช่างสารอพาร์ทเม้นท์', 'Petchamongkol, ตำบลบ่อยาง อำเภอเมืองสงขลา สงขลา 90000', '2600', 'free wifi', 't0002', 'ไม่จำกัด', '085 622 6514', 'ช่างสารอพาร์ทเม้นท์'),
('r0014', 'ณัฐแมนชั่น', 'ตำบลบ่อยาง อำเภอเมืองสงขลา สงขลา 90000', '3000', 'free wifi', 't0002', 'ไม่จำกัด', '087 399 8273', 'ณัฐแมนชั่น'),
('r0015', 'ต.เจริญแมนชั่น', 'กาญจนวนิช ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '3500', 'free wifi', 't0002', 'ไม่จำกัด', '088 488 8008', 'ต.เจริญแมนชั่น'),
('r0016', 'อภัสนันท์ เพลส', 'ตำบลบ่อยาง อำเภอเมืองสงขลา สงขลา 90000', '3000', 'free wifi', 't0003', 'ไม่จำกัด', '085 641 4653', 'อภัสนันท์ เพลส'),
('r0017', 'เรือนทิพย์', '49/1-2 ถนนทะเลหลวง ตำบลบ่อยาง อำเภอเมืองสงขลา สงขลา 90000', '2600', 'free wifi', 't0003', 'ไม่จำกัด', '074 436 078', 'เรือนทิพย์'),
('r0018', 'ดวงธิดา อพาร์ทเม้นท์', '99/44 กาญจนวนิช ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '3000', 'free wifi', 't0002', 'ไม่จำกัด', '074 558 351', 'ดวงธิดา อพาร์ทเม้นท์'),
('r0019', 'หอพักพิจิตรสุวรรณ4', '23 ถนนกาญจนวนิช ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '3200', 'free wifi', 't0004', 'ไม่จำกัด', '065 556 4423', 'หอพักพิจิตรสุวรรณ4'),
('r0020', 'ตะวันภู อาพาร์ทเม้น', 'ตำบล เขารูปช้าง อำเภอเมืองสงขลา สงขลา 90000', '2800', 'free wifi', 't0002', 'ไม่จำกัด', '098 015 0907', 'ตะวันภู อาพาร์ทเม้น'),
('r0021', 'ดีคอนโด  หาดใหญ่', 'ถนนกาญจนวนิช ตำบล คอหงส์ อำเภอหาดใหญ่ สงขลา 90110', '5500', 'free wifi', 't0001', 'ไม่จำกัด', '02 201 3999', 'ดีคอนโด  หาดใหญ่'),
('r0022', 'พลัสคอนโด หาดใหญ่2', '682 ถนน เพชรเกษม ตำบล หาดใหญ่ อำเภอหาดใหญ่ สงขลา 90110', '6000', 'free wifi', 't0001', 'ไม่จำกัด', '082 436 7774', 'พลัสคอนโด หาดใหญ่2'),
('r0023', 'The Rise Residence', '11 ถนน ประชายินดี ตำบล หาดใหญ่ อำเภอหาดใหญ่ สงขลา 90110', '5300', 'free wifi', 't0001', 'ไม่จำกัด', '081 959 9119', 'The Rise Residence'),
('r0024', 'The Best Condominium', 'ถนน ทวีรัตน์อุทิศ ตำบล หาดใหญ่ อำเภอหาดใหญ่ สงขลา 90110', '5000', 'free wifi', 't0001', 'ไม่จำกัด', '065 223 0041', 'The Best Condominium'),
('r0025', 'คอนโดซิตี้โฮม', '60/309 ถนน ภาสว่าง ตำบล คอหงส์ อำเภอหาดใหญ่ สงขลา 90110', '5000', 'free wifi', 't0001', 'ไม่จำกัด', '088 788 3097', 'คอนโดซิตี้โฮม'),
('r0026', 'Prompt Condominium', 'ถนน ทุ่งรี-โคกวัด ตำบล คอหงส์ อำเภอหาดใหญ่ สงขลา 90110', '5200', 'free wifi', 't0001', 'ไม่จำกัด', '089 656 9999', 'Prompt Condominium'),
('r0027', 'Plus Condo 1 Hatyai', 'เพชรเกษม ซอย 6/2 ตำบล คอหงส์ อำเภอหาดใหญ่ สงขลา 90110', '5300', 'free wifi', 't0001', 'ไม่จำกัด', '095 103 8383', 'Plus Condo 1 Hatyai'),
('r0028', 'The First Condominium', 'ราษฎร์ยินดี ซอย 6 ตำบล หาดใหญ่ อำเภอหาดใหญ่ สงขลา 90110', '5300', 'free wifi', 't0001', 'ไม่จำกัด', '081 898 5554', 'The First Condominium');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `rentedroom`
--
ALTER TABLE `rentedroom`
  ADD PRIMARY KEY (`id_rentedroom`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
